<template>
  <main>
    <lazy-sections-hero-catalog image="/images/pages/catalog/chain-link/1.png" :breadcrumbs="breadcrumbs">
      <h1 class="text-[1.5rem] font-medium text-green-505 leading-small">Установка заборов из сетки рабицы в Самаре и области</h1>
      <p class="my-4.5 text-gray-205">
        В компании «Забор163» вы можете заказать изготовление и установку забора из сетки рабицы под ключ. Мы работаем в Самаре, Тольятти и по всей Самарской
        области. Наши заборы из сетки рабицы – это практичное, доступное и надежное решение для ограждения вашего участка.
      </p>
    </lazy-sections-hero-catalog>
    <lazy-sections-features />
    <lazy-sections-banner />
    <div class="md:py-20 pt-16 pb-4">
      <div class="container">
        <lazy-sections-features-catalog image="/images/pages/catalog/chain-link/2.png">
          <h2 class="text-[2rem] leading-small font-medium text-green-505">Почему выбирают заборы из сетки рабицы</h2>
          <ul class="mt-6">
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Экономичность:</span> Заборы из металлической сетки рабицы – одно из самых бюджетных решений для ограждения,
              обеспечивающее отличное соотношение цены и качества.
            </li>
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Прозрачность:</span> Сетка пропускает свет, сохраняя открытость участка и не препятствуя росту растений.
            </li>
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Долговечность:</span> Оцинкованная или полимерная сетка устойчива к коррозии, погодным условиям и механическим
              повреждениям.
            </li>
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Быстрая установка:</span> Монтаж забора из сетки рабицы выполняется быстро, обычно за 1–2 дня.
            </li>
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Универсальность:</span> Подходит для дачных участков, садов, огородов и временных ограждений.
            </li>
          </ul>
        </lazy-sections-features-catalog>
      </div>
    </div>
    <div class="md:py-20 pt-4 pb-16">
      <div class="container">
        <h2 class="text-[2rem] font-medium text-center text-green-505">Стоимость заборов из сетки рабицы</h2>
        <p class="text-gray-150 md:text-lg mt-8 text-center">
          С компанией «Забор163» вы получаете надежный забор из сетки рабицы для вашей дачи или участка по цене, которая приятно удивит! Мы предлагаем доступные
          решения без потери качества, чтобы ваш участок был защищен и выглядел аккуратно. Стоимость зависит от высоты забора, типа сетки (оцинкованная или с
          полимерным покрытием), длины участка и дополнительных элементов, таких как ворота или калитки. Прозрачная смета и индивидуальный подход гарантируют,
          что вы получите лучшее предложение под ваш бюджет. Оставьте заявку на забор из металлической рабицы под ключ, и наш специалист бесплатно рассчитает
          точную стоимость, предложив оптимальный вариант для вас!
        </p>
        <lazy-sections-table class="mt-6" :headers="tableHeaders" :table-data="tableData" />
        <p class="text-gray-150 md:text-lg mt-8 text-center">
          Сетка изготавливается из проволоки диаметром от 2 мм. Обязательное требование — заводская оцинковка. Плетение осуществляется на специализированных
          станках, что исключает дефекты и пропуски петель. Возможна разработка сетки с различными диаметрами и формами ячеек.
        </p>
      </div>
    </div>
    <lazy-sections-stages :stages="stagesData">
      <template #title>
        <h2 class="text-[2rem] lg:text-[2.5rem] font-medium mt-4 leading-small text-green-505">Этапы работы по установке забора из сетки рабицы</h2>
      </template>
    </lazy-sections-stages>
    <lazy-sections-tabs :tabs="tabsData" />
    <lazy-sections-recommended />
    <lazy-sections-colors :colors="colors" />
    <lazy-sections-slider-works :images="images">
      <template #head>
        <h2 class="text-[2rem] lg:text-[2.5rem] font-medium mt-4 leading-small text-green-505">Готовые работы заборов из сетки рабицы</h2>
        <p class="text-gray-150 md:text-[1.5rem] mt-8">
          Ознакомьтесь с нашими готовыми проектами заборов из сетки рабицы под ключ. Мы предлагаем практичные и аккуратные решения для дачных участков, садов и
          огородов, выполненные с высоким качеством. Каждый проект демонстрирует профессионализм нашей команды.
        </p>
      </template>
    </lazy-sections-slider-works>
    <lazy-sections-callback />
    <lazy-sections-slider-recommendations />
  </main>
</template>

<script lang="ts" setup>
const data = reactive({
  title: 'Установка забора для частного дома или дачи под ключ — Самара, Самарская область',
  description:
    'Установите забор в Самаре и Самарской области под ключ. Низкие цены за погонный метр, качественные материалы и бесплатный замер. Изготовим металлический забор из профнастила, на ленточном фундаменте, 3D-забор, сетку-рабицу, штакетник и другие варианты по вашему желанию. Звоните по телефону +7 (920) 344-70-27.',
  image: '/images/catalog/9.png',
});

const breadcrumbs = [{ title: 'Главная', to: '/' }, { title: 'Забор из сетки рабицы' }];

const tableHeaders: string[] = ['Высота (M)', 'Толщина', 'Сетка', 'Протяжка', 'Стоимость (руб./п.м.)'];

const tableData: Record<string, string>[] = [
  {
    height: '1,5',
    thickness: '60x40 мм',
    posts: 'Рабица 1,8 мм',
    coating: 'Без протяжек',
    cost: 'От 3 500',
  },
  {
    height: '1,7',
    thickness: '60x40 мм',
    posts: 'Рабица 1,8 мм',
    coating: 'Без протяжек',
    cost: 'От 3 700',
  },
  {
    height: '1,8',
    thickness: '60x40 мм',
    posts: 'Рабица 1,8 мм',
    coating: 'Без протяжек',
    cost: 'От 3 900',
  },
  {
    height: '2,0',
    thickness: '60x40 мм',
    posts: 'Рабица 1,8 мм',
    coating: 'Без протяжек',
    cost: 'От 4 000',
  },
  {
    height: '1,5',
    thickness: '60x40 мм',
    posts: 'Рабица 1,8 мм',
    coating: 'В два ряда (10 мм)',
    cost: 'От 4 000',
  },
  {
    height: '1,7',
    thickness: '60x40 мм',
    posts: 'Рабица 1,8 мм',
    coating: 'В два ряда (10 мм)',
    cost: 'От 4 200',
  },
  {
    height: '1,8',
    thickness: '60x40 мм',
    posts: 'Рабица 1,8 мм',
    coating: 'В два ряда (10 мм)',
    cost: 'От 4 300',
  },
  {
    height: '2,0',
    thickness: '60x40 мм',
    posts: 'Рабица 1,8 мм',
    coating: 'В два ряда (10 мм)',
    cost: 'От 4 500',
  },
];

const colors = ref([
  {
    image: '/images/colors/1.jpg',
    shade: 'RAL 3003',
    title: 'Рубиново-красный',
  },
  {
    image: '/images/colors/2.jpg',
    shade: 'RAL 3005',
    title: 'Винно-красный',
  },
  {
    image: '/images/colors/3.jpg',
    shade: 'RAL 6002',
    title: 'Лиственно-зелёный',
  },
  {
    image: '/images/colors/4.jpg',
    shade: 'RAL 6005',
    title: 'Зелёный мох',
  },
  {
    image: '/images/colors/5.jpg',
    shade: 'RAL 8017',
    title: 'Шоколадно-коричневый',
  },
  {
    image: '/images/colors/6.jpg',
    shade: 'RAL 9002',
    title: 'Светло-серый',
  },
  {
    image: '/images/colors/7.jpg',
    shade: 'RAL 9003',
    title: 'Сигнальный белый',
  },
  {
    image: '/images/colors/8.jpg',
    shade: 'RAL 7004',
    title: 'Сигнальный серый',
  },
  {
    image: '/images/colors/9.jpg',
    shade: 'RAL 1018',
    title: 'Цинково-жёлтый',
  },
  {
    image: '/images/colors/10.jpg',
    shade: 'RAL 5005',
    title: 'Сигнальный синий',
  },
]);

const images = ['/images/pages/catalog/chain-link/3.png', '/images/pages/catalog/chain-link/4.png', '/images/pages/catalog/chain-link/5.png'];

const tabsData = [
  {
    id: 'монтаж',
    title: 'Монтаж',
    description: 'После бесплатного замера и подписания договора наша команда приступает к установке забора из сетки рабицы.',
    processTitle: 'Мы гарантируем качество и оперативность за счет четко организованного процесса:',
    items: [
      {
        title: 'Подготовка участка.',
        description: 'Очистка территории от растительности, мусора и препятствий. Разметка линии забора с помощью колышков и шнура для ровной установки.',
      },
      {
        title: 'Установка металлических столбов.',
        description:
          'В грунте бурятся или выкапываются ямы глубиной 0,8–1,2 м (в зависимости от типа почвы и высоты забора). Столбы 60х40 мм устанавливаются вертикально и бетонируются для устойчивости. Расстояние между столбами – 2,5–3 м.',
      },
      {
        title: 'Монтаж горизонтальных лаг.',
        description:
          'К столбам привариваются или прикручиваются металлические лаги (поперечные профили 40x20 мм). Они служат основой для крепления листов профнастила. Лаги обрабатываются антикоррозийным покрытием для защиты от ржавчины.',
      },
      {
        title: 'Крепление сетки рабицы.',
        description:
          'Сетка натягивается между столбами и фиксируется с помощью проволоки, скоб или специальных зажимов. Для большей прочности возможна установка арматурного прутка сверху и снизу сетки.',
      },
      {
        title: 'Установка дополнительных элементов (при наличии этих элементов в заказе).',
        description: 'Монтируются ворота, калитки и, при необходимости, декоративные элементы. Проверяется натяжение сетки и надежность креплений.',
      },
      {
        title: 'Финальная проверка и сдача объекта.',
        description:
          'Проводится осмотр забора на предмет дефектов, проверяется устойчивость конструкции. Убирается строительный мусор, и забор передается заказчику с гарантией качества.',
      },
    ],
  },
  {
    id: 'сроки',
    title: 'Сроки',
    description:
      'Сроки установки забора из сетки рабицы зависят от объема работ и особенностей участка. Мы обеспечиваем максимальную оперативность и соблюдение всех договоренностей:',
    items: [
      {
        title: 'Согласование и замер (1–2 дня).',
        description:
          'Выезд специалиста для замера и обсуждения деталей (высота, длина, тип сетки, дополнительные элементы). Сложные участки могут потребовать до 2 дней.',
      },
      {
        title: 'Подготовка материалов (1–3 дня).',
        description:
          'Закупка сетки рабицы, столбов и крепежей у поставщиков или изготовление на собственном производстве. Нестандартные размеры или покрытия могут увеличить срок подготовки.',
      },
      {
        title: 'Доставка на участок (1 день).',
        description: 'Быстрая доставка рабицы в Самаре, Тольятти и области с помощью нашего автопарка.',
      },
      {
        title: 'Монтаж забора (1–2 дня).',
        description:
          'Монтаж стандартного забора (до 50 м) занимает 1 день. Для больших участков или сложных условий (неровный грунт, демонтаж старого забора) – от 2 дней.',
      },
    ],
  },
  {
    id: 'доставка',
    title: 'Доставка',
    description:
      'Компания «Забор163» обеспечивает быструю и надежную доставку всех материалов для заборов из сетки рабицы в Самаре, Тольятти и Самарской области. Мы используем собственный автопарк для оперативной транспортировки сетки, столбов и крепежей. Стоимость доставки обычно включена в стоимость работ и рассчитывается индивидуально в зависимости от объема заказа. Наши сотрудники выполняют погрузку и разгрузку, гарантируя сохранность материалов и удобство для последующего монтажа.',
  },
];

const stagesData = [
  {
    icon: '/images/icons/doc-checkmark.svg',
    title: 'Оформление заявки',
    description: 'Заявка через сайт или по телефону',
  },
  {
    icon: '/images/icons/measurement.svg',
    title: 'Бесплатная замерка',
    description: 'Бесплатный выезд замерщика на ваш участок для оценки и составления сметы',
  },
  {
    icon: '/images/icons/doc-success.svg',
    title: 'Подписание документации',
    description: 'Составление сметы и подписание договора',
  },
  {
    icon: '/images/icons/delivery-truck.svg',
    title: 'Доставка материалов',
    description: 'Доставим материалы (сетка рабица, столбы, крепежи) на ваш участок',
  },
  {
    icon: '/images/icons/worker.svg',
    title: 'Рабочий процесс',
    description: 'Монтаж забора из сетки рабицы под ключ (1–2 дня)',
  },
  {
    icon: '/images/icons/ok-finger.svg',
    title: 'Приемка работ',
    description: 'Вы принимаете работу и получаете гарантию на 1 год',
  },
];

useSeo(data);
</script>
