<template>
  <main>
    <lazy-sections-hero-catalog image="/images/pages/catalog/picket-fence/1.png" :breadcrumbs="breadcrumbs">
      <h1 class="text-[1.5rem] font-medium text-green-505 leading-small">Установка заборов из металлического штакетника в Самаре и области</h1>
      <p class="my-4.5 text-gray-205">
        В компании «Забор163» вы можете купить металлический штакетник для забора и заказать его установку под ключ. Мы работаем в Самаре, Тольятти и по всей
        Самарской области, предлагая надежные и стильные решения для ограждения вашего участка. Забор из металлического штакетника – это идеальное сочетание
        эстетики, долговечности и доступной цены, подходящее для частных домов, дач и коммерческих объектов.
      </p>
    </lazy-sections-hero-catalog>
    <lazy-sections-features />
    <lazy-sections-banner />
    <div class="md:py-20 pt-16 pb-4">
      <div class="container">
        <lazy-sections-features-catalog image="/images/pages/catalog/picket-fence/2.png">
          <h2 class="text-[2rem] leading-small font-medium text-green-505">Преимущества заборов из металлического штакетника</h2>
          <ul class="mt-6">
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Долговечность:</span> Забор из евроштакетника изготовлен из оцинкованной стали с полимерным покрытием, устойчив к
              коррозии, погодным условиям и механическим повреждениям, обеспечивая срок службы до 30 лет.
            </li>
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Эстетика:</span> Широкий выбор цветов (RAL-палитра) и текстур, включая имитацию дерева, позволяет создать забор из
              евроштакетника, который гармонично впишется в любой ландшафт.
            </li>
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Гибкость дизайна:</span> Возможность выбора одностороннего или двустороннего покрытия, а также горизонтального
              штакетника или шахматного расположения для большей приватности.
            </li>
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Простота установки:</span> Монтаж занимает всего 1–2 дня, что делает забор из штакетника металлического удобным и
              быстрым решением.
            </li>
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Экономичность:</span> Цена за погонный метр у забора из штакетника остается доступной, обеспечивая оптимальное
              соотношение качества и стоимости.
            </li>
          </ul>
        </lazy-sections-features-catalog>
      </div>
    </div>
    <div class="md:py-20 pt-4 pb-16">
      <div class="container">
        <h2 class="text-[2rem] font-medium text-center text-green-505">Цены на заборы из металлического штакетника</h2>
        <p class="text-gray-150 md:text-lg mt-8 text-center">
          Мы предлагаем изготовление и установку заборов из металлического штакетника под ключ по выгодной цене. Наши ограждения сочетают долговечность,
          эстетику и экономичность. Цена за метр забора из евроштакетника зависит от высоты, формы штакетника, типа покрытия (одностороннее или двустороннее) и
          дополнительных элементов, таких как ворота или калитки. Мы гарантируем прозрачную смету без скрытых доплат и индивидуальный подход. Оставьте заявку
          прямо сейчас, и наш специалист бесплатно рассчитает стоимость забора из штакетника, предложив лучшее решение для вашего бюджета!
        </p>
        <lazy-sections-table class="mt-6" :headers="tableHeaders" :table-data="tableData" />
      </div>
    </div>
    <lazy-sections-stages :stages="stagesData">
      <template #title>
        <h2 class="text-[2rem] lg:text-[2.5rem] font-medium mt-4 leading-small text-green-505">Этапы работы по установке забора из евроштакетника</h2>
      </template>
    </lazy-sections-stages>
    <lazy-sections-tabs :tabs="tabsData" />
    <lazy-sections-recommended />
    <lazy-sections-colors :colors="colors" />
    <lazy-sections-slider-works :images="images">
      <template #head>
        <h2 class="text-[2rem] lg:text-[2.5rem] font-medium mt-4 leading-small text-green-505">Готовые работы заборов из металлического штакетника</h2>
        <p class="text-gray-150 md:text-[1.5rem] mt-8">
          Ознакомьтесь с нашими проектами заборов из штакетника в Самаре и Самарской области. Мы предлагаем разнообразные дизайны – от классических до
          современных, включая заборы горизонтального штакетника и шахматные конструкции. Каждый проект демонстрирует профессионализм нашей команды и высокое
          качество материалов.
        </p>
      </template>
    </lazy-sections-slider-works>
    <lazy-sections-callback />
    <lazy-sections-slider-recommendations />
  </main>
</template>

<script lang="ts" setup>
const data = reactive({
  title: 'Установка забора для частного дома или дачи под ключ — Самара, Самарская область',
  description:
    'Установите забор в Самаре и Самарской области под ключ. Низкие цены за погонный метр, качественные материалы и бесплатный замер. Изготовим металлический забор из профнастила, на ленточном фундаменте, 3D-забор, сетку-рабицу, штакетник и другие варианты по вашему желанию. Звоните по телефону +7 (920) 344-70-27.',
  image: '/images/catalog/9.png',
});

const breadcrumbs = [{ title: 'Главная', to: '/' }, { title: 'Забор из профнастила' }];

const tableHeaders: string[] = ['Тип штакетника', 'Вид штакетника', 'Столбы (Проф. труба)', 'Покрытие', 'Стоимость (руб./п.м.)'];

const tableData: Record<string, string>[] = [
  {
    height: 'Односторонний',
    thickness: 'П-образный',
    posts: '60x60 мм',
    coating: 'Полимер',
    cost: 'От 6 500',
  },
  {
    height: 'Двусторонний',
    thickness: 'П-образный',
    posts: '60x60 мм',
    coating: 'Полимер',
    cost: 'От 7 500',
  },
  {
    height: 'Односторонний',
    thickness: 'М-образный',
    posts: '60x60 мм',
    coating: 'Защитная покраска',
    cost: 'От 6 500',
  },
  {
    height: 'Двусторонний',
    thickness: 'М-образный',
    posts: '60x60 мм',
    coating: 'Защитная покраска',
    cost: 'От 7 500',
  },
  {
    height: '—',
    thickness: 'Полукруглый',
    posts: '60x60 мм',
    coating: 'Защитная покраска',
    cost: 'От 8 500',
  },
];

const colors = ref([
  {
    image: '/images/colors/1.jpg',
    shade: 'RAL 3003',
    title: 'Рубиново-красный',
  },
  {
    image: '/images/colors/2.jpg',
    shade: 'RAL 3005',
    title: 'Винно-красный',
  },
  {
    image: '/images/colors/3.jpg',
    shade: 'RAL 6002',
    title: 'Лиственно-зелёный',
  },
  {
    image: '/images/colors/4.jpg',
    shade: 'RAL 6005',
    title: 'Зелёный мох',
  },
  {
    image: '/images/colors/5.jpg',
    shade: 'RAL 8017',
    title: 'Шоколадно-коричневый',
  },
  {
    image: '/images/colors/6.jpg',
    shade: 'RAL 9002',
    title: 'Светло-серый',
  },
  {
    image: '/images/colors/7.jpg',
    shade: 'RAL 9003',
    title: 'Сигнальный белый',
  },
  {
    image: '/images/colors/8.jpg',
    shade: 'RAL 7004',
    title: 'Сигнальный серый',
  },
  {
    image: '/images/colors/9.jpg',
    shade: 'RAL 1018',
    title: 'Цинково-жёлтый',
  },
  {
    image: '/images/colors/10.jpg',
    shade: 'RAL 5005',
    title: 'Сигнальный синий',
  },
]);

const images = ['/images/pages/catalog/picket-fence/3.png', '/images/pages/catalog/picket-fence/4.png', '/images/pages/catalog/picket-fence/5.png'];

const tabsData = [
  {
    id: 'монтаж',
    title: 'Монтаж',
    description: 'После бесплатного замера и подписания договора наша команда приступает к установке забора из металлического штакетника.',
    processTitle: 'Мы обеспечиваем надежность и долговечность за счет профессионального подхода',
    items: [
      {
        title: 'Подготовка участка.',
        description: 'Очистка территории от растительности, мусора и препятствий. Разметка линии забора с помощью колышков и шнура для точной геометрии.',
      },
      {
        title: 'Установка металлических столбов.',
        description:
          'В грунте бурятся или выкапываются ямы глубиной 0,8–1,2 м (в зависимости от высоты забора и типа почвы). Столбы 60х60 мм устанавливаются вертикально и бетонируются для устойчивости. Расстояние между столбами – 2–3 м.',
      },
      {
        title: 'Монтаж горизонтальных лаг.',
        description:
          'К столбам привариваются или прикручиваются металлические лаги (поперечные профили 40х20 мм) с антикоррозийным покрытием, которые служат основой для крепления штакетника.',
      },
      {
        title: 'Крепление штакетника.',
        description:
          'Металлический штакетник (П-образный, М-образный или полукруглый) крепится к лагам с помощью саморезов с резиновой шайбой. Возможна установка горизонтального штакетника или в шахматном порядке для уникального дизайна. Расстояние между штакетинами регулируется для желаемого уровня приватности.',
      },
      {
        title: 'Установка дополнительных элементов.',
        description: 'Монтируются ворота, калитки, декоративные планки или колпаки на столбы. Проверяется надежность всех креплений и выравнивание.',
      },
      {
        title: 'Финальная проверка и сдача объекта.',
        description:
          'Проводится осмотр забора на предмет дефектов, проверяется устойчивость конструкции. Убирается строительный мусор, и объект сдается с гарантией качества.',
      },
    ],
  },
  {
    id: 'сроки',
    title: 'Сроки',
    description:
      'Сроки установки забора из штакетника зависят от объема работ и особенностей участка. Мы гарантируем оперативность и соблюдение договоренностей:',
    items: [
      {
        title: 'Согласование и замер (1–2 дня).',
        description:
          'Выезд специалиста для замера, оценки грунта и обсуждения деталей (высота, длина, цвет, ворота). Сложные участки могут потребовать до 2 дней.',
      },
      {
        title: 'Подготовка материалов (1–3 дня).',
        description:
          'Изготовление штакетника на собственном производстве, столбов, крепежей и антикоррозийных покрытий. Нестандартные цвета или размеры могут увеличить срок подготовки.',
      },
      {
        title: 'Доставка на участок (1 день).',
        description: 'Быстрая доставка материалов в Самаре, Тольятти и области с помощью нашего автопарка.',
      },
      {
        title: 'Монтаж забора (1–2 дня).',
        description:
          'Монтаж стандартного забора (до 50 м) занимает 1 день. Для больших участков или сложных условий (неровный рельеф, демонтаж старого забора) – от 2 дней.',
      },
    ],
  },
  {
    id: 'доставка',
    title: 'Доставка',
    description:
      'Компания «Забор163» обеспечивает быструю и надежную доставку всех материалов для заборов из евроштакетника в Самаре, Тольятти и Самарской области. Мы используем собственный автопарк для оперативной транспортировки штакетника, столбов и крепежей. Стоимость доставки рассчитывается индивидуально в зависимости от расстояния и объема заказа. Наши сотрудники выполняют погрузку и разгрузку, гарантируя сохранность материалов и удобство для последующего монтажа.',
  },
];
const stagesData = [
  {
    icon: '/images/icons/doc-checkmark.svg',
    title: 'Оформление заявки',
    description: 'Заявка через сайт или по телефону',
  },
  {
    icon: '/images/icons/measurement.svg',
    title: 'Бесплатная замерка',
    description: 'Бесплатный выезд замерщика на ваш участок для оценки и составления сметы',
  },
  {
    icon: '/images/icons/doc-success.svg',
    title: 'Подписание документации',
    description: 'Составление сметы и подписание договора',
  },
  {
    icon: '/images/icons/delivery-truck.svg',
    title: 'Доставка материалов',
    description: 'Доставим материалы (штакетник, столбы, крепежи) на ваш участок',
  },
  {
    icon: '/images/icons/worker.svg',
    title: 'Рабочий процесс',
    description: 'Монтаж забора из металлического штакетника под ключ (1–2 дня)',
  },
  {
    icon: '/images/icons/ok-finger.svg',
    title: 'Приемка работ',
    description: 'Вы принимаете работу и получаете гарантию на 1 год',
  },
];

useSeo(data);
</script>
