<template>
  <main>
    <lazy-sections-hero-catalog image="/images/pages/catalog/profiled-flooring/1.png" :breadcrumbs="breadcrumbs">
      <h1 class="text-[1.5rem] font-medium text-green-505 leading-small">
        Установка заборов из <br />
        профнастила в Самаре и <br />
        области
      </h1>
      <p class="my-4.5 text-gray-205">
        В компании «Забор163» вы можете заказать изготовление или установку готового забора из профлиста под ключ. Мы работаем по Самаре и Самарской области.
        Наши надёжные заборы из профнастила прослужат долго и идеально подойдут вашему участку.
      </p>
    </lazy-sections-hero-catalog>
    <lazy-sections-features />
    <lazy-sections-banner />
    <div class="md:py-20 pt-16 pb-4">
      <div class="container">
        <lazy-sections-features-catalog image="/images/pages/catalog/profiled-flooring/2.png">
          <h2 class="text-[2rem] leading-small font-medium text-green-505">Почему выбирают заборы из профлиста</h2>
          <ul class="mt-6">
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Долговечность:</span> Забор из профнастила с металлическими столбами устойчив к коррозии, погодным условиям и
              механическим повреждениям.
            </li>
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Эстетика:</span> Широкая цветовая палитра позволит выбрать любой оттенок на ваш вкус.
            </li>
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Цена:</span> Забор из профлиста – оптимальный выбор для бюджета, баланс цены и качества с прозрачным расчетом
              стоимости.
            </li>
            <li class="relative pl-6 mt-3 text-gray-150 text-lg">
              <span class="absolute w-1.5 h-1.5 rounded-full bg-green-105 top-2.5 left-1"></span>
              <span class="text-green-105">Быстрая установка:</span> Монтаж забора из профлиста выполняется в кратчайшие сроки, обычно до 3 дней.
            </li>
          </ul>
        </lazy-sections-features-catalog>
      </div>
    </div>
    <div class="md:py-20 pt-4 pb-16">
      <div class="container">
        <h2 class="text-[2rem] font-medium text-center text-green-505">Стоимость заборов из профнастила</h2>
        <div class="relative">
          <lazy-sections-table class="mt-6" :headers="tableHeaders" :table-data="tableData" />
          <lazy-sections-universal-calculator
            class="mt-6 lg:sticky bottom-0"
            :initial-n1="1"
            :initial-n2="1"
            :initial-sotki="6"
            :initial-price="3200"
            title="Калькулятор стоимости забора из профнастила"
          />
        </div>
      </div>
    </div>
    <lazy-sections-stages :stages="stagesData">
      <template #title>
        <h2 class="text-[2rem] lg:text-[2.5rem] font-medium mt-4 leading-small text-green-505">Этапы работы по установке забора из профнастила</h2>
      </template>
    </lazy-sections-stages>
    <lazy-sections-tabs :tabs="tabsData" />
    <lazy-sections-recommended />
    <lazy-sections-colors :colors="colors" />
    <lazy-sections-slider-works :images="images">
      <template #head>
        <h2 class="text-[2rem] lg:text-[2.5rem] font-medium mt-4 leading-small text-green-505">Готовые работы заборов из профнастила</h2>
        <p class="text-gray-150 md:text-[1.5rem] mt-8">
          Ознакомьтесь с нашими проектами заборов из профнастила на ленточном фундаменте в Самаре и Самарской области. Мы предлагаем разнообразные дизайны – от
          классических до современных – с акцентом на качество и долговечность. Каждый проект отражает профессионализм нашей команды.
        </p>
      </template>
    </lazy-sections-slider-works>
    <lazy-sections-callback />
    <lazy-sections-slider-recommendations />
  </main>
</template>

<script lang="ts" setup>
const data = reactive({
  title: 'Установка забора для частного дома или дачи под ключ — Самара, Самарская область',
  description:
    'Установите забор в Самаре и Самарской области под ключ. Низкие цены за погонный метр, качественные материалы и бесплатный замер. Изготовим металлический забор из профнастила, на ленточном фундаменте, 3D-забор, сетку-рабицу, штакетник и другие варианты по вашему желанию. Звоните по телефону +7 (920) 344-70-27.',
  image: '/images/catalog/9.png',
});

const breadcrumbs = [{ title: 'Главная', to: '/' }, { title: 'Забор из профнастила' }];

const tableHeaders: string[] = ['Высота (M)', 'Толщина', 'Столбы', 'Покрытие', 'Стоимость (руб./п.м.)'];

const tableData: Record<string, string>[] = [
  {
    height: '1,5',
    thickness: '0,45 мм',
    posts: '60x60 мм',
    coating: 'Цинк',
    cost: 'От 3 200',
  },
  {
    height: '1,8',
    thickness: '0,45 мм',
    posts: '60x60 мм',
    coating: 'Цинк',
    cost: 'От 3 300',
  },
  {
    height: '2,0',
    thickness: '0,45 мм',
    posts: '60x60 мм',
    coating: 'Цинк',
    cost: 'От 3 500',
  },
  {
    height: '2,5',
    thickness: '0,45 мм',
    posts: '60x60 мм',
    coating: 'Цинк',
    cost: 'От 4 500',
  },
  {
    height: '1,5',
    thickness: '0,4 мм',
    posts: '60x60 мм',
    coating: 'Полимер',
    cost: 'От 3 500',
  },
  {
    height: '1,8',
    thickness: '0,4 мм',
    posts: '60x60 мм',
    coating: 'Полимер',
    cost: 'От 3 700',
  },
  {
    height: '2,0',
    thickness: '0,4 мм',
    posts: '60x60 мм',
    coating: 'Полимер',
    cost: 'От 4 000',
  },
];

const colors = ref([
  {
    image: '/images/colors/1.jpg',
    shade: 'RAL 3003',
    title: 'Рубиново-красный',
  },
  {
    image: '/images/colors/2.jpg',
    shade: 'RAL 3005',
    title: 'Винно-красный',
  },
  {
    image: '/images/colors/3.jpg',
    shade: 'RAL 6002',
    title: 'Лиственно-зелёный',
  },
  {
    image: '/images/colors/4.jpg',
    shade: 'RAL 6005',
    title: 'Зелёный мох',
  },
  {
    image: '/images/colors/5.jpg',
    shade: 'RAL 8017',
    title: 'Шоколадно-коричневый',
  },
  {
    image: '/images/colors/6.jpg',
    shade: 'RAL 9002',
    title: 'Светло-серый',
  },
  {
    image: '/images/colors/7.jpg',
    shade: 'RAL 9003',
    title: 'Сигнальный белый',
  },
  {
    image: '/images/colors/8.jpg',
    shade: 'RAL 7004',
    title: 'Сигнальный серый',
  },
  {
    image: '/images/colors/9.jpg',
    shade: 'RAL 1018',
    title: 'Цинково-жёлтый',
  },
  {
    image: '/images/colors/10.jpg',
    shade: 'RAL 5005',
    title: 'Сигнальный синий',
  },
]);

const images = [
  '/images/pages/catalog/profiled-flooring/3.png',
  '/images/pages/catalog/profiled-flooring/4.png',
  '/images/pages/catalog/profiled-flooring/5.png',
];

const tabsData = [
  {
    id: 'монтаж',
    title: 'Монтаж',
    description:
      'Проведя бесплатный замер и подписав договор, наша команда приступает к этапу монтажа. Наши бригады используют металлические столбы для забора из профлиста и выполняют монтаж быстро, качественно и с учетом всех технических требований.',
    processTitle: 'Мы обеспечиваем надежность и долговечность за счёт чётко организованного процесса:',
    items: [
      {
        title: 'Подготовка участка. ',
        description:
          'Проводится очистка территории от растительности, мусора и препятствий. Выполняется разметка линии забора с помощью колышков и шнура, чтобы обеспечить ровную установку.',
      },
      {
        title: 'Установка металлических столбов.',
        description:
          'В грунте бурятся или выкапываются ямы глубиной 0,8–1,2 м (в зависимости от типа почвы и высоты забора). Столбы для забора из профнастила (металлические трубы 60x60 мм) устанавливаются вертикально и бетонируются для устойчивости. Расстояние между столбами – 2–3 м.',
      },
      {
        title: 'Монтаж горизонтальных лаг.',
        description:
          'К столбам привариваются или прикручиваются металлические лаги (поперечные профили 40x20 мм). Они служат основой для крепления листов профнастила. Лаги обрабатываются антикоррозийным покрытием для защиты от ржавчины.',
      },
      {
        title: 'Крепление профнастила.',
        description:
          'Листы профнастила крепятся к лагам с помощью саморезов с резиновой шайбой, обеспечивающих герметичность соединений. Листы монтируются внахлест (на одну волну) для прочности и скрытия стыков. При желании возможна установка горизонтального забора из профнастила.',
      },
      {
        title: 'Установка дополнительных элементов.',
        description:
          'Монтируются ворота, калитки, декоративные планки или колпаки на столбы. Проверяется надежность всех креплений и при необходимости корректируется выравнивание.',
      },
      {
        title: 'Финальная проверка и сдача объекта.',
        description:
          'Проводится осмотр забора на предмет дефектов, проверяется устойчивость конструкции. Убирается строительный мусор, и забор передается заказчику с гарантией качества.',
      },
    ],
  },
  {
    id: 'сроки',
    title: 'Сроки',
    description:
      'Сроки выполнения работ по установке забора из профнастила под ключ в Самаре, Тольятти и Самарской области зависят от нескольких факторов. Мы стремимся завершить проект максимально быстро, сохраняя высокое качество, поэтому гарантируем оперативность и четкое соблюдение договоренностей. Временные рамки, на которые вы можете ориентироваться:',
    items: [
      {
        title: 'Согласование и замер (1–2 дня).',
        description:
          'После вашего обращения мы организуем выезд специалиста для замера участка и обсуждения деталей проекта (высота забора, длина, тип профнастила, цвет, дополнительные элементы вроде ворот или калитки). Обычно это занимает 1 день. В случае сложных участков или необходимости согласования соседями процесс может занять до 2 дней.',
      },
      {
        title: 'Подготовка материалов (1–7 дней)',
        description:
          'После утверждения сметы и дизайна мы заказываем или изготавливаем материалы: листы профнастила, металлические столбы, лаги, крепежи и антикоррозийные покрытия. Если материалы есть в наличии, подготовка занимает 1 день. При заказе нестандартных цветов или размеров может потребоваться больше времени.',
      },
      {
        title: 'Доставка на участок (1 день).',
        description:
          'Благодаря собственному автопарку мы обеспечиваем быструю доставку материалов. Для участков в Самаре и Тольятти доставка выполняется в течение 1 дня.',
      },
      {
        title: 'Монтаж забора (1–3 дня).',
        description:
          'Монтаж забора из профлиста – ключевой этап, который в большинстве случаев завершается за 1 день для стандартных участков (до 50 погонных метров). Для больших участков (100+ метров) или сложных условий (неровный грунт, необходимость демонтажа старого забора) монтаж может занять больше времени.',
      },
    ],
  },
  {
    id: 'доставка',
    title: 'Доставка',
    description:
      'Компания «Забор163» обеспечивает быструю и надежную доставку всех необходимых материалов для изготовления и установки заборов из профлиста в Самаре, Тольятти и по всей Самарской области. Мы берем на себя все логистические процессы, чтобы вы могли сосредоточиться на выборе дизайна и планировании вашего забора из профнастила под ключ.',
    subDescription:
      'Мы располагаем современным автопарком, включающим грузовые автомобили, что позволяет оперативно доставлять материалы. Стоимость доставки рассчитывается индивидуально и зависит от расстояния до вашего участка, объёма заказа и срочности доставки. Все работы по погрузке и разгрузке материалов выполняют наши сотрудники. Это гарантирует сохранность профнастила и столбов для забора из профлиста во время транспортировки. Наши рабочие аккуратно размещают материалы на участке, чтобы облегчить последующий монтаж.',
  },
];
const stagesData = [
  {
    icon: '/images/icons/doc-checkmark.svg',
    title: 'Оформление заявки',
    description: 'Заявка через сайт или по телефону',
  },
  {
    icon: '/images/icons/measurement.svg',
    title: 'Бесплатная замерка',
    description: 'Бесплатный выезд замерщика на ваш участок',
  },
  {
    icon: '/images/icons/doc-success.svg',
    title: 'Подписание документации',
    description: 'Составляем смету и подписываем договор',
  },
  {
    icon: '/images/icons/delivery-truck.svg',
    title: 'Доставка материалов',
    description: 'Доставим материалы на ваш участок',
  },
  {
    icon: '/images/icons/worker.svg',
    title: 'Рабочий процесс',
    description: 'Монтаж забора из профлиста и столбов под ключ (1–3 дня)',
  },
  {
    icon: '/images/icons/ok-finger.svg',
    title: 'Приемка работ',
    description: 'Вы принимаете работу и получаете гарантию на 1 год',
  },
];

useSeo(data);
</script>
